In [ ]:
#dataset I need: first names of all bootcamp graduates/attendees (manually/scraping) - Linkedin
#treatment I need: classification based on first names into male/female (Naive Bayes with dictionaries of most common names?)

#look at word stems
#how many features 
#Facebook API is pretty limited--first names and genders from public profiles from Facebook
#Find a Wikipedia project containing all the articles: organize in a taxinomy: gender/first name with labels, look into XML dumps
#open source dictionary

#two big challenges
#Wrangling together as many as name/gender matches to create a classifier
#Wrangling together first names of bootcamp graduates

#http://stackoverflow.com/questions/33440939/cant-pip-install-packages-in-anaconda
#https://en.wikipedia.org/wiki/Category:Feminine_given_names

In [32]:
import pandas as pd
from sklearn.naive_bayes import MultinomialNB
import requests
from bs4 import BeautifulSoup

In [3]:
names = pd.read_csv("NationalNames.csv")
len(names)/2

912716.5

In [6]:
names.head(3)

   Id  Name  Year Gender  Count
0   1  Mary  1880      F   7065
1   2  Anna  1880      F   2604
2   3  Emma  1880      F   2003

In [20]:
namepivot = names.pivot(index='Name', columns='Gender', values='Count')
namepivot.head(6)

ValueError: Index contains duplicate entries, cannot reshape

In [28]:
namestack = pd.pivot_table(names,index =["Name"],columns = ["Gender"], values = ["Count"])
namestack.head(25)

               Count
Gender             F           M
Name
Aaban            NaN   10.285714
Aabha       7.000000         NaN
Aabid            NaN    5.000000
Aabriella   5.000000         NaN
Aadam            NaN    8.521739
Aadan            NaN   12.444444
Aadarsh          NaN   11.285714
Aaden       5.000000  279.642857
Aadesh           NaN    5.000000
Aadhav           NaN   12.750000
Aadhavan         NaN    6.333333
Aadhi            NaN    6.000000
Aadhira     9.666667         NaN
Aadhya     79.875000         NaN
Aadhyan          NaN    5.000000
Aadi        5.333333   55.583333
Aadian           NaN    5.000000
Aadil            NaN   12.913043
Aadin            NaN   12.444444
Aadish           NaN    8.500000
Aadison     5.500000         NaN
Aadit            NaN   22.250000
Aadith           NaN    6.500000
Aaditri     6.500000         NaN
Aaditya          NaN   25.388889

In [29]:
namestack.fillna(value = 0)

               Count
Gender             F           M
Name
Aaban       0.000000   10.285714
Aabha       7.000000    0.000000
Aabid       0.000000    5.000000
Aabriella   5.000000    0.000000
Aadam       0.000000    8.521739
Aadan       0.000000   12.444444
Aadarsh     0.000000   11.285714
Aaden       5.000000  279.642857
Aadesh      0.000000    5.000000
Aadhav      0.000000   12.750000
Aadhavan    0.000000    6.333333
Aadhi       0.000000    6.000000
Aadhira     9.666667    0.000000
Aadhya     79.875000    0.000000
Aadhyan     0.000000    5.000000
Aadi        5.333333   55.583333
Aadian      0.000000    5.000000
Aadil       0.000000   12.913043
Aadin       0.000000   12.444444
Aadish      0.000000    8.500000
Aadison     5.500000    0.000000
Aadit       0.000000   22.250000
Aadith      0.000000    6.500000
Aaditri     6.500000    0.000000
Aaditya     0.000000   25.388889
Aadiv       0.000000    5.500000
Aadon       0.000000   10.000000
Aadrian     0.000000    5.000000
Aadrika     5.000000    0.000000
Aadrit      0.000000    5.000000
...              ...         ...
Zyrese      0.000000    5.000000
Zyrhiana    6.000000    0.000000
Zyri        6.000000    0.000000
Zyria      18.833333    0.000000
Zyriah     22.928571    0.000000
Zyrian      0.000000    5.000000
Zyriana     6.000000    0.000000
Zyrianna    6.833333    0.000000
Zyrie       6.500000    0.000000
Zyriel      5.000000    0.000000
Zyrielle    7.333333    0.000000
Zyrihanna   6.428571    0.000000
Zyrin       0.000000    5.000000
Zyrion      0.000000    9.333333
Zyriyah     5.500000    0.000000
Zyron       0.000000   10.733333
Zyrus       0.000000    7.285714
Zysean      0.000000    5.000000
Zyshaun     0.000000    5.666667
Zyshawn     0.000000    8.588235
Zyshon      0.000000    6.333333
Zyshonne    0.000000   16.833333
Zytaevius   0.000000    5.000000
Zytaveon    0.000000    7.500000
Zytavion    0.000000    5.000000
Zytavious   0.000000    6.142857
Zyvion      0.000000    5.000000
Zyyanna     6.000000    0.000000
Zyyon       0.000000    6.000000
Zzyzx       0.000000    5.000000

[93889 rows x 2 columns]

In [30]:
#namestack is the table I want to process, but there are problems getting the columns to work
namestack[namestack.index == "Mary"]

              Count
Gender            F           M
Name
Mary    30483.57037  116.607692

In [11]:
namestack.tail(25)

                      Count            Id         Year
Name      Gender
Zyrian    M        5.000000  1.588226e+06  2007.000000
Zyriana   F        6.000000  1.622782e+06  2008.500000
Zyrianna  F        6.833333  1.655244e+06  2009.500000
Zyrie     F        6.500000  1.691010e+06  2010.500000
Zyriel    F        5.000000  1.694022e+06  2010.500000
Zyrielle  F        7.333333  1.739949e+06  2012.000000
Zyrihanna F        6.428571  1.678247e+06  2010.142857
Zyrin     M        5.000000  1.792308e+06  2013.000000
Zyrion    M        9.333333  1.678028e+06  2009.777778
Zyriyah   F        5.500000  1.742996e+06  2012.000000
Zyron     M       10.733333  1.578858e+06  2006.800000
Zyrus     M        7.285714  1.620133e+06  2008.000000
Zysean    M        5.000000  1.454295e+06  2003.000000
Zyshaun   M        5.666667  1.473965e+06  2003.500000
Zyshawn   M        8.588235  1.554011e+06  2006.000000
Zyshon    M        6.333333  1.403308e+06  2001.333333
Zyshonne  M       16.833333  1.371668e+06  2000.500000
Zytaevius M        5.000000  1.759186e+06  2012.000000
Zytaveon  M        7.500000  1.771411e+06  2012.500000
Zytavion  M        5.000000  1.725502e+06  2011.000000
Zytavious M        6.142857  1.557666e+06  2006.142857
Zyvion    M        5.000000  1.657592e+06  2009.000000
Zyyanna   F        6.000000  1.674537e+06  2010.000000
Zyyon     M        6.000000  1.823482e+06  2014.000000
Zzyzx     M        5.000000  1.691633e+06  2010.000000

In [10]:
now = names[names.Year == 2014]
now.head(20)
#groupby and do gender count by name : Name, Gender, Count
#using data from all of the years could be useful ex: edge cases like winfred
#consider adding UK name set
#consider looking into pivottable : http://pandas.pydata.org/pandas-docs/stable/reshaping.html

#binary classification can be used for names in the table
#Naive Bayes model can be built on character traits and character transitions to define a name not in the table 
#go through coursereport and take 500 names

#Action items for next week
#1 - Clean up the dataframe here, do a first pass for the gender classifier
#2 - Draft more on the story of the project
#3 - Use requests and BS4 and get at least 300-500 names from CourseReport

              Id       Name  Year Gender  Count
1792389  1792390       Emma  2014      F  20799
1792390  1792391     Olivia  2014      F  19674
1792391  1792392     Sophia  2014      F  18490
1792392  1792393   Isabella  2014      F  16950
1792393  1792394        Ava  2014      F  15586
1792394  1792395        Mia  2014      F  13442
1792395  1792396      Emily  2014      F  12562
1792396  1792397    Abigail  2014      F  11985
1792397  1792398    Madison  2014      F  10247
1792398  1792399  Charlotte  2014      F  10048
1792399  1792400     Harper  2014      F   9564
1792400  1792401      Sofia  2014      F   9542
1792401  1792402      Avery  2014      F   9517
1792402  1792403  Elizabeth  2014      F   9492
1792403  1792404     Amelia  2014      F   8727
1792404  1792405     Evelyn  2014      F   8692
1792405  1792406       Ella  2014      F   8489
1792406  1792407      Chloe  2014      F   8469
1792407  1792408   Victoria  2014      F   7955
1792408  1792409     Aubrey  2014      F   7589

In [12]:
nowmale = now[now.Gender == "M"]
nowmale.head(3)

              Id   Name  Year Gender  Count
1811456  1811457   Noah  2014      M  19144
1811457  1811458   Liam  2014      M  18342
1811458  1811459  Mason  2014      M  17092

In [13]:
nowemma = now[now.Name == "Emma"]
nowemma.head(3)

              Id  Name  Year Gender  Count
1792389  1792390  Emma  2014      F  20799
1818165  1818166  Emma  2014      M     12

In [13]:
fortyfive = names[names.Year == 1945]
fortyfive.head(10)

            Id      Name  Year Gender  Count
412324  412325      Mary  1945      F  59284
412325  412326     Linda  1945      F  41465
412326  412327   Barbara  1945      F  38272
412327  412328  Patricia  1945      F  35841
412328  412329     Carol  1945      F  30387
412329  412330    Sandra  1945      F  24700
412330  412331     Nancy  1945      F  21454
412331  412332    Sharon  1945      F  20832
412332  412333    Judith  1945      F  20187
412333  412334     Susan  1945      F  19223

In [14]:
fortyfivemen = fortyfive[fortyfive.Gender == "M"]
fortyfivemen.head(5)

            Id     Name  Year Gender  Count
417567  417568    James  1945      M  74450
417568  417569   Robert  1945      M  69926
417569  417570     John  1945      M  66123
417570  417571  William  1945      M  50209
417571  417572  Richard  1945      M  46045

In [15]:
fortyfivemen.tail(5)

            Id       Name  Year Gender  Count
421344  421345     Ysmael  1945      M      5
421345  421346   Zacarias  1945      M      5
421346  421347       Zach  1945      M      5
421347  421348  Zachariah  1945      M      5
421348  421349      Zenon  1945      M      5

## Importing names from Course Report

In [43]:
#1 how do I automate this across different pages? Different workshops, different pages
review = requests.get("https://www.coursereport.com/schools/galvanize#/reviews")
r = BeautifulSoup(review.text, "lxml")
first_name = r.find_all('div', {'class': 'reviewer-details'})

In [44]:
print(first_name)

[<div class="reviewer-details"><span class="reviewer-name">Anonymous</span><span> • Developer Evangelist </span><span></span><span class="hidden-xs"> •  Course: Web Development </span><span class="hidden-xs"> •  Campus: Boulder </span></div>, <div class="reviewer-details"><span class="reviewer-name">kt </span><span> • Front-End Engineer  </span><span> • Graduate </span><span class="hidden-xs"> •  Course: Web Development </span><span class="hidden-xs"> •  Campus: San Francisco </span></div>, <div class="reviewer-details"><span class="reviewer-name">Anonymous</span><span></span><span> • Graduate </span><span class="hidden-xs"> •  Course: Galvanize Data Science </span><span class="hidden-xs"> •  Campus: San Francisco </span></div>, <div class="reviewer-details"><span class="reviewer-name">Anonymous</span><span></span><span> • Graduate </span><span class="hidden-xs"> •  Course: Galvanize Data Science </span><span class="hidden-xs"> •  Campus: San Francisco </span></div>, <div class="reviewer-details"><span class="reviewer-name">Steve </span><span> • IoT Node.js Developer </span><span> • Graduate </span><span class="hidden-xs"> •  Course: Web Development </span><span class="hidden-xs"> •  Campus: San Francisco </span></div>, <div class="reviewer-details"><span class="reviewer-name">Anna VM </span><span> • Data Scientist </span><span></span><span class="hidden-xs"> •  Course: Galvanize Data Science </span><span class="hidden-xs"> •  Campus: San Francisco </span></div>, <div class="reviewer-details"><span class="reviewer-name">Jennifer Dunne </span><span></span><span> • Graduate </span><span class="hidden-xs"> •  Course: Galvanize Data Science </span><span class="hidden-xs"> •  Campus: Denver </span></div>, <div class="reviewer-details"><span class="reviewer-name">Josh Cantor </span><span></span><span> • Graduate </span><span class="hidden-xs"></span><span class="hidden-xs"></span></div>, <div class="reviewer-details"><span class="reviewer-name">Anonymous</span><span> • Data Scientist </span><span> • Graduate </span><span class="hidden-xs"> •  Course: Galvanize Data Science </span><span class="hidden-xs"> •  Campus: San Francisco </span></div>, <div class="reviewer-details"><span class="reviewer-name">Gerard Cote </span><span> • Associate Software Engineer, Oracle Data Cloud </span><span> • Graduate </span><span class="hidden-xs"> •  Course: Web Development </span><span class="hidden-xs"> •  Campus: Boulder </span></div>, <div class="reviewer-details"><span class="reviewer-name">Anonymous</span><span></span><span></span><span class="hidden-xs"> •  Course: Web Development </span><span class="hidden-xs"> •  Campus: Boulder </span></div>, <div class="reviewer-details"><span class="reviewer-name">Anonymous</span><span> • Data Scientist </span><span> • Graduate </span><span class="hidden-xs"> •  Course: Galvanize Data Science </span><span class="hidden-xs"> •  Campus: Seattle </span></div>, <div class="reviewer-details"><span class="reviewer-name">Alex Braun </span><span> • Computer Vision Scientist </span><span> • Graduate </span><span class="hidden-xs"> •  Course: Galvanize Data Science </span><span class="hidden-xs"> •  Campus: San Francisco </span></div>, <div class="reviewer-details"><span class="reviewer-name">Anonymous</span><span> • Front End Developer </span><span> • Student </span><span class="hidden-xs"> •  Course: Web Development </span><span class="hidden-xs"> •  Campus: San Francisco </span></div>, <div class="reviewer-details"><span class="reviewer-name">Elana Kopelevich </span><span> • Web Development Resident </span><span> • Graduate </span><span class="hidden-xs"> •  Course: Web Development </span><span class="hidden-xs"> •  Campus: Denver </span></div>, <div class="reviewer-details"><span class="reviewer-name">Anonymous</span><span></span><span> • Graduate </span><span class="hidden-xs"> •  Course: Galvanize Data Science </span><span class="hidden-xs"> •  Campus: San Francisco </span></div>, <div class="reviewer-details"><span class="reviewer-name">Anonymous</span><span> • data scientist </span><span></span><span class="hidden-xs"> •  Course: Galvanize Data Science </span><span class="hidden-xs"> •  Campus: Seattle </span></div>, <div class="reviewer-details"><span class="reviewer-name">Colin </span><span> • Data Scientist </span><span> • Graduate </span><span class="hidden-xs"> •  Course: Galvanize Data Science </span><span class="hidden-xs"> •  Campus: Seattle </span></div>, <div class="reviewer-details"><span class="reviewer-name">Anonymous</span><span> • Data Scientist </span><span> • Graduate </span><span class="hidden-xs"> •  Course: Galvanize Data Science </span><span class="hidden-xs"> •  Campus: Seattle </span></div>, <div class="reviewer-details"><span class="reviewer-name">Eric Hullander </span><span> • Data Scientist </span><span> • Graduate </span><span class="hidden-xs"> •  Course: Galvanize Data Science </span><span class="hidden-xs"> •  Campus: Seattle </span></div>, <div class="reviewer-details"><span class="reviewer-name">Anonymous</span><span> • Data Scientist </span><span> • Graduate </span><span class="hidden-xs"> •  Course: Galvanize Data Science </span><span class="hidden-xs"> •  Campus: San Francisco </span></div>, <div class="reviewer-details"><span class="reviewer-name">Japneet Singh </span><span> • Data Scientist </span><span> • Graduate </span><span class="hidden-xs"> •  Course: Galvanize Data Science </span><span class="hidden-xs"> •  Campus: San Francisco </span></div>, <div class="reviewer-details"><span class="reviewer-name">J </span><span> • Software Engineer </span><span></span><span class="hidden-xs"> •  Course: Web Development </span><span class="hidden-xs"> •  Campus: Boulder </span></div>, <div class="reviewer-details"><span class="reviewer-name">Anonymous</span><span> • Software Engineer  </span><span> • Student </span><span class="hidden-xs"> •  Course: Web Development </span><span class="hidden-xs"> •  Campus: San Francisco </span></div>, <div class="reviewer-details"><span class="reviewer-name">Anonymous</span><span> • Developer </span><span> • Graduate </span><span class="hidden-xs"></span><span class="hidden-xs"> •  Campus: Denver </span></div>]

In [46]:
spans = r.find_all('span', attrs={'class':'reviewer-name'})
for span in spans:
    print (span.string)

Anonymous
kt
Anonymous
Anonymous
Steve
Anna VM
Jennifer Dunne
Josh Cantor
Anonymous
Gerard Cote
Anonymous
Anonymous
Alex Braun
Anonymous
Elana Kopelevich
Anonymous
Anonymous
Colin
Anonymous
Eric Hullander
Anonymous
Japneet Singh
J
Anonymous
Anonymous

In [51]:
cleanspans = []
for span in spans:
    if span.string != "Anonymous":
        cleanspans.append(span)
        print (span.string)

kt
Steve
Anna VM
Jennifer Dunne
Josh Cantor
Gerard Cote
Alex Braun
Elana Kopelevich
Colin
Eric Hullander
Japneet Singh
J